RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
/*
 * Copyright (c) 2006-2025, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date         Author      Notes
 * 2024-03-19   Evlers      first implementation
 */

#include "drv_usart_v2.h"

#ifdef RT_USING_SERIAL_V2

#if !defined(BSP_USING_UART0) && !defined(BSP_USING_UART1) && \
    !defined(BSP_USING_UART2) && !defined(BSP_USING_UART3) && \
    !defined(BSP_USING_UART4) && !defined(BSP_USING_UART5) && \
    !defined(BSP_USING_UART6) && !defined(BSP_USING_UART7)
#error "Please define at least one UARTx"

#endif

#include <rtdevice.h>

enum {
#ifdef BSP_USING_UART0
    UART0_INDEX,
#endif
#ifdef BSP_USING_UART1
    UART1_INDEX,
#endif
#ifdef BSP_USING_UART2
    UART2_INDEX,
#endif
#ifdef BSP_USING_UART3
    UART3_INDEX,
#endif
#ifdef BSP_USING_UART4
    UART4_INDEX,
#endif
#ifdef BSP_USING_UART5
    UART5_INDEX,
#endif
#ifdef BSP_USING_UART6
    UART6_INDEX,
#endif
#ifdef BSP_USING_UART7
    UART7_INDEX,
#endif
};

static struct gd32_uart uart_obj[] = {
    #ifdef BSP_USING_UART0
    {
        "uart0",
        USART0,                                 /* uart peripheral index */
        USART0_IRQn,                            /* uart iqrn */
        RCU_USART0, RCU_GPIOA, RCU_GPIOA,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOA, GPIO_AF_7, GPIO_PIN_9,           /* tx port, tx alternate, tx pin */
        GPIOA, GPIO_AF_7, GPIO_PIN_10,          /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E23x
        GPIOA, GPIO_AF_1, GPIO_PIN_9,
        GPIOA, GPIO_AF_1, GPIO_PIN_10,
#else
        GPIOA, GPIO_PIN_9,           /* tx port, tx pin */
        GPIOA, GPIO_PIN_10,          /* rx port, rx pin */
#endif

#if defined SOC_SERIES_GD32E23x
#ifdef BSP_UART0_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(2),
#endif
#ifdef BSP_UART0_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(1),
#endif
#else
#ifdef BSP_UART0_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(1, 5, 4),
#endif
#ifdef BSP_UART0_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(1, 7, 4),
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART1
    {
        "uart1",
        USART1,                                 /* uart peripheral index */
        USART1_IRQn,                            /* uart iqrn */
        RCU_USART1, RCU_GPIOA, RCU_GPIOA,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOA, GPIO_AF_7, GPIO_PIN_2,           /* tx port, tx alternate, tx pin */
        GPIOA, GPIO_AF_7, GPIO_PIN_3,           /* rx port, rx alternate, rx pin */
#elif defined SOC_SERIES_GD32E23x
        GPIOA, GPIO_AF_1, GPIO_PIN_14,
        GPIOA, GPIO_AF_1, GPIO_PIN_15,
#else
        GPIOA, GPIO_PIN_2,                      /* tx port, tx pin */
        GPIOA, GPIO_PIN_3,                      /* rx port, rx pin */
#endif
#if defined SOC_SERIES_GD32E23x
#ifdef BSP_UART1_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(4),
#endif
#ifdef BSP_UART1_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(3),
#endif
#else
#ifdef BSP_UART1_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 5, 4),
#endif
#ifdef BSP_UART1_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 6, 4),
#endif
#endif
    },
    #endif

    #ifdef BSP_USING_UART2
    {
        "uart2",
        USART2,                                 /* uart peripheral index */
        USART2_IRQn,                            /* uart iqrn */
        RCU_USART2, RCU_GPIOB, RCU_GPIOB,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOB, GPIO_AF_7, GPIO_PIN_10,          /* tx port, tx alternate, tx pin */
        GPIOB, GPIO_AF_7, GPIO_PIN_11,          /* rx port, rx alternate, rx pin */
#else
        GPIOB, GPIO_PIN_10,          /* tx port, tx pin */
        GPIOB, GPIO_PIN_11,          /* rx port, rx pin */
#endif
#ifdef BSP_UART2_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 1, 4),
#endif
#ifdef BSP_UART2_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 3, 4),
#endif
    },
    #endif

    #ifdef BSP_USING_UART3
    {
        "uart3",
        UART3,                                 /* uart peripheral index */
        UART3_IRQn,                            /* uart iqrn */
        RCU_UART3, RCU_GPIOC, RCU_GPIOC,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOC, GPIO_AF_8, GPIO_PIN_10,         /* tx port, tx alternate, tx pin */
        GPIOC, GPIO_AF_8, GPIO_PIN_11,         /* rx port, rx alternate, rx pin */
#else
        GPIOC, GPIO_PIN_10,         /* tx port, tx pin */
        GPIOC, GPIO_PIN_11,         /* rx port, rx pin */
#endif
#ifdef BSP_UART3_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 2, 4),
#endif
#ifdef BSP_UART3_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 4, 4),
#endif
    },
    #endif

    #ifdef BSP_USING_UART4
    {
        "uart4",
        UART4,                                 /* uart peripheral index */
        UART4_IRQn,                            /* uart iqrn */
        RCU_UART4, RCU_GPIOC, RCU_GPIOD,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOC, GPIO_AF_8, GPIO_PIN_12,         /* tx port, tx alternate, tx pin */
        GPIOD, GPIO_AF_8, GPIO_PIN_2,          /* rx port, rx alternate, rx pin */
#else
        GPIOC, GPIO_PIN_12,         /* tx port, tx pin */
        GPIOD, GPIO_PIN_2,          /* rx port, rx pin */
#endif
#ifdef BSP_UART4_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 0, 4),
#endif
#ifdef BSP_UART4_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 7, 4),
#endif
    },
    #endif

    #ifdef BSP_USING_UART5
    {
        "uart5",
        USART5,                                 /* uart peripheral index */
        USART5_IRQn,                            /* uart iqrn */
        RCU_USART5, RCU_GPIOC, RCU_GPIOC,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOC, GPIO_AF_8, GPIO_PIN_6,           /* tx port, tx alternate, tx pin */
        GPIOC, GPIO_AF_8, GPIO_PIN_7,           /* rx port, rx alternate, rx pin */
#else
        GPIOC, GPIO_PIN_6,           /* tx port, tx pin */
        GPIOC, GPIO_PIN_7,           /* rx port, rx pin */
#endif
#ifdef BSP_UART5_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(1, 1, 5),
#endif
#ifdef BSP_UART5_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(1, 7, 5),
#endif
    },
    #endif

    #ifdef BSP_USING_UART6
    {
        "uart6",
        UART6,                                 /* uart peripheral index */
        UART6_IRQn,                            /* uart iqrn */
        RCU_UART6, RCU_GPIOE, RCU_GPIOE,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOE, GPIO_AF_8, GPIO_PIN_7,          /* tx port, tx alternate, tx pin */
        GPIOE, GPIO_AF_8, GPIO_PIN_8,          /* rx port, rx alternate, rx pin */
#else
        GPIOE, GPIO_PIN_7,          /* tx port, tx pin */
        GPIOE, GPIO_PIN_8,          /* rx port, rx pin */
#endif
#ifdef BSP_UART6_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 3, 5),
#endif
#ifdef BSP_UART6_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 1, 5),
#endif
    },
    #endif

    #ifdef BSP_USING_UART7
    {
        "uart7",
        UART7,                                 /* uart peripheral index */
        UART7_IRQn,                            /* uart iqrn */
        RCU_UART7, RCU_GPIOE, RCU_GPIOE,       /* periph clock, tx gpio clock, rt gpio clock */
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx
        GPIOE, GPIO_AF_8, GPIO_PIN_0,          /* tx port, tx alternate, tx pin */
        GPIOE, GPIO_AF_8, GPIO_PIN_1,          /* rx port, rx alternate, rx pin */
#else
        GPIOE, GPIO_PIN_0,          /* tx port, tx pin */
        GPIOE, GPIO_PIN_1,          /* rx port, rx pin */
#endif
#ifdef BSP_UART7_RX_USING_DMA
        .dma.rx = DRV_DMA_CONFIG(0, 6, 5),
#endif
#ifdef BSP_UART7_TX_USING_DMA
        .dma.tx = DRV_DMA_CONFIG(0, 0, 5),
#endif
    },
    #endif
};


#ifdef RT_SERIAL_USING_DMA
static void dma_recv_isr (struct rt_serial_device *serial)
{
    struct gd32_uart *uart;
    rt_size_t recv_len, counter;
    rt_base_t level;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    recv_len = 0;
    level = rt_hw_interrupt_disable();
    #if defined SOC_SERIES_GD32E23x
    counter = dma_transfer_number_get(uart->dma.rx.channel);
    #else
    counter = dma_transfer_number_get(uart->dma.rx.periph, uart->dma.rx.channel);
    #endif
    if (counter <= uart->dma.last_index)
    {
        recv_len = uart->dma.last_index - counter;
    }
    else
    {
        recv_len = serial->config.dma_ping_bufsz + uart->dma.last_index - counter;
    }
    uart->dma.last_index = counter;
    rt_hw_interrupt_enable(level);

