RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
    if (recv_len)
    {
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
    }
}
#endif

static void usart_isr (struct rt_serial_device *serial)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE) != RESET)
    {
        struct rt_serial_rx_fifo *rx_fifo;
        rx_fifo = (struct rt_serial_rx_fifo *) serial->serial_rx;
        RT_ASSERT(rx_fifo != RT_NULL);

        char chr = usart_data_receive(uart->periph);
        rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_PUTC, &chr);
        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_RX_IND);

        /* Clear RXNE interrupt flag */
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RBNE);
    }
    else if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TBE) != RESET)
    {
        rt_uint8_t put_char = 0;
        if (rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_GETC, &put_char) == RT_EOK)
        {
            usart_data_transmit(uart->periph, put_char);
        }
        else
        {
            usart_interrupt_disable(uart->periph, USART_INT_TBE);
            usart_interrupt_enable(uart->periph, USART_INT_TC);
        }
        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TBE);
    }
    else if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_TC) != RESET)
    {
        usart_interrupt_disable(uart->periph, USART_INT_TC);

        rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DONE);

        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_TC);
    }

#ifdef RT_SERIAL_USING_DMA
    else if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_IDLE) != RESET)
    {
        volatile uint8_t data = (uint8_t)usart_data_receive(uart->periph);

        dma_recv_isr(serial);

        usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_IDLE);
    }
#endif
    else
    {
        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_ORERR) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_ORERR);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_NERR) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_NERR);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_ERR_FERR) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_ERR_FERR);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RBNE_ORERR) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RBNE_ORERR);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_PERR) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_PERR);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_CTS) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_CTS);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_LBD) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_LBD);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_EB) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_EB);
        }

        if (usart_interrupt_flag_get(uart->periph, USART_INT_FLAG_RT) != RESET)
        {
            usart_interrupt_flag_clear(uart->periph, USART_INT_FLAG_RT);
        }
    }
}

#if defined(BSP_UART0_RX_USING_DMA) || \
    defined(BSP_UART1_RX_USING_DMA) || \
    defined(BSP_UART2_RX_USING_DMA) || \
    defined(BSP_UART3_RX_USING_DMA) || \
    defined(BSP_UART4_RX_USING_DMA) || \
    defined(BSP_UART5_RX_USING_DMA) || \
    defined(BSP_UART6_RX_USING_DMA) || \
    defined(BSP_UART7_RX_USING_DMA)

static void dma_rx_isr (struct rt_serial_device *serial)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    #if defined SOC_SERIES_GD32E23x
    if ((dma_interrupt_flag_get(uart->dma.rx.channel, DMA_INT_FLAG_HTF) != RESET) ||
        (dma_interrupt_flag_get(uart->dma.rx.channel, DMA_INT_FLAG_FTF) != RESET))
    {
        dma_recv_isr(serial);

        /* clear dma flag */
        dma_interrupt_flag_clear(uart->dma.rx.channel, DMA_INT_FLAG_HTF);
        dma_interrupt_flag_clear(uart->dma.rx.channel, DMA_INT_FLAG_FTF);
    }
    #else
    if ((dma_interrupt_flag_get(uart->dma.rx.periph, uart->dma.rx.channel, DMA_INT_FLAG_HTF) != RESET) ||
        (dma_interrupt_flag_get(uart->dma.rx.periph, uart->dma.rx.channel, DMA_INT_FLAG_FTF) != RESET))
    {
        dma_recv_isr(serial);

        /* clear dma flag */
        dma_interrupt_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_INT_FLAG_HTF);
        dma_interrupt_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_INT_FLAG_FTF);
    }
    #endif
}

#endif

#if defined(BSP_UART0_TX_USING_DMA) || \
    defined(BSP_UART1_TX_USING_DMA) || \
    defined(BSP_UART2_TX_USING_DMA) || \
    defined(BSP_UART3_TX_USING_DMA) || \
    defined(BSP_UART4_TX_USING_DMA) || \
    defined(BSP_UART5_TX_USING_DMA) || \
    defined(BSP_UART6_TX_USING_DMA) || \
    defined(BSP_UART7_TX_USING_DMA)
static void dma_tx_isr (struct rt_serial_device *serial)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    #if defined SOC_SERIES_GD32E23x
    {
        rt_size_t trans_total_index;

        /* clear dma flag */
        dma_interrupt_flag_clear(uart->dma.tx.channel, DMA_INT_FLAG_FTF);

        /* disable dma tx channel */
        dma_channel_disable(uart->dma.tx.channel);

        trans_total_index = dma_transfer_number_get(uart->dma.tx.channel);

        if (trans_total_index == 0)
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
    }
    #else
    if (dma_interrupt_flag_get(uart->dma.tx.periph, uart->dma.tx.channel, DMA_INT_FLAG_FTF) != RESET)
    {
        rt_size_t trans_total_index;

        /* clear dma flag */
        dma_interrupt_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_INT_FLAG_FTF);

