RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
        /* disable dma tx channel */
        dma_channel_disable(uart->dma.tx.periph, uart->dma.tx.channel);

        trans_total_index = dma_transfer_number_get(uart->dma.tx.periph, uart->dma.tx.channel);

        if (trans_total_index == 0)
        {
            rt_hw_serial_isr(serial, RT_SERIAL_EVENT_TX_DMADONE);
        }
    }
    #endif
}
#endif

#if defined(BSP_USING_UART0)
void USART0_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART0_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART0 */

#if defined(BSP_USING_UART1)
void USART1_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART1_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART1 */

#if defined(BSP_USING_UART2)
void USART2_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART2_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART2 */

#if defined(BSP_USING_UART3)
void UART3_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART3_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART3 */

#if defined(BSP_USING_UART4)
void UART4_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART4_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif /* BSP_USING_UART4 */

#if defined(BSP_USING_UART5)
void USART5_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART5_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART5 */

#if defined(BSP_USING_UART6)
void UART6_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART6_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART6 */

#if defined(BSP_USING_UART7)
void UART7_IRQHandler (void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    usart_isr(&uart_obj[UART7_INDEX].serial);

    /* leave interrupt */
    rt_interrupt_leave();
}

#endif /* BSP_USING_UART7 */
#if define SOC_SERIES_GD32E23x
#if define BSP_UART0_RX_USING_DMA || define BSP_UART0_TX_USING_DMA
void DMA_Channel1_2_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    if (dma_interrupt_flag_get(DMA_CH1, DMA_INT_FLAG_FTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH1, DMA_INT_FLAG_G);
        dma_tx_isr(&uart_obj[UART0_INDEX].serial);
    }

    if (dma_interrupt_flag_get(DMA_CH2, DMA_INT_FLAG_HTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH2, DMA_INT_FLAG_HTF);
        dma_recv_isr(&uart_obj[UART0_INDEX].serial);
    }
    else if (dma_interrupt_flag_get(DMA_CH2, DMA_INT_FLAG_FTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH2, DMA_INT_FLAG_FTF);
        dma_recv_isr(&uart_obj[UART0_INDEX].serial);
    }

    /* leave interrupt */
    rt_interrupt_leave();
}
#endif
#else
#ifdef BSP_UART0_RX_USING_DMA
void DMA1_Channel5_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART0_INDEX].serial);
}
#endif

#ifdef BSP_UART0_TX_USING_DMA
void DMA1_Channel7_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART0_INDEX].serial);
}
#endif
#endif

#if defined SOC_SERIES_GD32E23x

#if defined BSP_UART1_RX_USING_DMA || defined BSP_UART1_TX_USING_DMA
void DMA_Channel3_4_IRQHandler(void)
{
    rt_interrupt_enter();

    if (dma_interrupt_flag_get(DMA_CH3, DMA_INT_FLAG_FTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH3, DMA_INT_FLAG_G);
        dma_tx_isr(&uart_obj[UART1_INDEX].serial);
    }

    if (dma_interrupt_flag_get(DMA_CH4, DMA_INT_FLAG_HTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH4, DMA_INT_FLAG_HTF);
        dma_recv_isr(&uart_obj[UART1_INDEX].serial);
    }

    if (dma_interrupt_flag_get(DMA_CH4, DMA_INT_FLAG_FTF) != RESET)
    {
        dma_interrupt_flag_clear(DMA_CH4, DMA_INT_FLAG_FTF);
        dma_recv_isr(&uart_obj[UART1_INDEX].serial);
    }

    rt_interrupt_leave();
}
#endif
#else
#ifdef BSP_UART1_RX_USING_DMA
void DMA0_Channel5_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART1_INDEX].serial);
}
#endif

#ifdef BSP_UART1_TX_USING_DMA
void DMA0_Channel6_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART1_INDEX].serial);
}
#endif
#endif

#ifdef BSP_UART2_RX_USING_DMA
void DMA0_Channel1_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART2_INDEX].serial);
}
#endif

#ifdef BSP_UART2_TX_USING_DMA
void DMA0_Channel3_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART2_INDEX].serial);
}
#endif

#ifdef BSP_UART3_RX_USING_DMA
void DMA0_Channel2_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART3_INDEX].serial);
}
#endif

#ifdef BSP_UART3_TX_USING_DMA
void DMA0_Channel4_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART3_INDEX].serial);
}
#endif

#ifdef BSP_UART4_RX_USING_DMA
void DMA0_Channel0_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART4_INDEX].serial);
}
#endif

#ifdef BSP_UART4_TX_USING_DMA
void DMA0_Channel7_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART4_INDEX].serial);
}
#endif

#ifdef BSP_UART5_RX_USING_DMA
void DMA1_Channel1_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART5_INDEX].serial);
}
#endif

#ifdef BSP_UART5_TX_USING_DMA
void DMA1_Channel7_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART5_INDEX].serial);
}
#endif

#ifdef BSP_UART6_RX_USING_DMA
void DMA0_Channel3_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART6_INDEX].serial);
}
#endif

#ifdef BSP_UART6_TX_USING_DMA
void DMA0_Channel1_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART6_INDEX].serial);
}
#endif

#ifdef BSP_UART7_RX_USING_DMA
void DMA0_Channel6_IRQHandler (void)
{
    dma_rx_isr(&uart_obj[UART7_INDEX].serial);
}
#endif

#ifdef BSP_UART7_TX_USING_DMA
void DMA0_Channel0_IRQHandler (void)
{
    dma_tx_isr(&uart_obj[UART7_INDEX].serial);
}
#endif

/**
* @brief UART MSP Initialization
*        This function configures the hardware resources used in this example:
*           - Peripheral's clock enable
*           - Peripheral's GPIO Configuration
*           - NVIC configuration for UART interrupt request enable
* @param huart: UART handle pointer
* @retval None
*/
void gd32_uart_gpio_init (struct gd32_uart *uart)
{
    /* enable USART clock */
    rcu_periph_clock_enable(uart->tx_gpio_clk);
    rcu_periph_clock_enable(uart->rx_gpio_clk);
    rcu_periph_clock_enable(uart->per_clk);

