RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
#if defined SOC_SERIES_GD32F4xx || defined SOC_SERIES_GD32F5xx || defined SOC_SERIES_GD32E23x
    /* connect port to USARTx_Tx */
    gpio_af_set(uart->tx_port, uart->tx_af, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_af_set(uart->rx_port, uart->rx_af, uart->rx_pin);

    /* configure USART Tx as alternate function push-pull */
    gpio_mode_set(uart->tx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->tx_pin);
    gpio_output_options_set(uart->tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* configure USART Rx as alternate function push-pull */
    gpio_mode_set(uart->rx_port, GPIO_MODE_AF, GPIO_PUPD_PULLUP, uart->rx_pin);
    gpio_output_options_set(uart->rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, uart->rx_pin);

#else
    /* connect port to USARTx_Tx */
    gpio_init(uart->tx_port, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, uart->tx_pin);

    /* connect port to USARTx_Rx */
    gpio_init(uart->rx_port, GPIO_MODE_IN_FLOATING, GPIO_OSPEED_50MHZ, uart->rx_pin);
#endif

    NVIC_SetPriority(uart->irqn, 0);
    NVIC_EnableIRQ(uart->irqn);
}

/**
  * @brief  uart configure
  * @param  serial, cfg
  * @retval None
  */
static rt_err_t gd32_uart_configure (struct rt_serial_device *serial, struct serial_configure *cfg)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    RT_ASSERT(cfg != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

#ifdef RT_SERIAL_USING_DMA
    uart->dma.last_index = serial->config.dma_ping_bufsz;
#endif

    gd32_uart_gpio_init(uart);

    usart_baudrate_set(uart->periph, cfg->baud_rate);

    switch (cfg->data_bits)
    {
    case DATA_BITS_9:
        usart_word_length_set(uart->periph, USART_WL_9BIT);
        break;

    default:
        usart_word_length_set(uart->periph, USART_WL_8BIT);
        break;
    }

    switch (cfg->stop_bits)
    {
    case STOP_BITS_2:
        usart_stop_bit_set(uart->periph, USART_STB_2BIT);
        break;
    default:
        usart_stop_bit_set(uart->periph, USART_STB_1BIT);
        break;
    }

    switch (cfg->parity)
    {
    case PARITY_ODD:
        usart_parity_config(uart->periph, USART_PM_ODD);
        break;
    case PARITY_EVEN:
        usart_parity_config(uart->periph, USART_PM_EVEN);
        break;
    default:
        usart_parity_config(uart->periph, USART_PM_NONE);
        break;
    }

    usart_receive_config(uart->periph, USART_RECEIVE_ENABLE);
    usart_transmit_config(uart->periph, USART_TRANSMIT_ENABLE);
    usart_enable(uart->periph);

    return RT_EOK;
}

#ifdef RT_SERIAL_USING_DMA
static void _uart_dma_receive (struct gd32_uart *uart, rt_uint8_t *buffer, rt_uint32_t size)
{
    /* clear all the interrupt flags */

    #if defined SOC_SERIES_GD32E23x
    dma_flag_clear(uart->dma.rx.channel, DMA_FLAG_G);
    dma_flag_clear(uart->dma.rx.channel, DMA_FLAG_FTF);
    dma_flag_clear(uart->dma.rx.channel, DMA_FLAG_HTF);
    dma_flag_clear(uart->dma.rx.channel, DMA_FLAG_ERR);
    dma_channel_disable(uart->dma.rx.channel);
    dma_deinit(uart->dma.rx.channel);

    /* configure receive DMA */
    rcu_periph_clock_enable(uart->dma.rx.rcu);
    dma_deinit(uart->dma.rx.channel);

    dma_parameter_struct dma_init_struct = { 0 };
    dma_init_struct.periph_addr = (uint32_t)&USART_RDATA(uart->periph);
    dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_addr = (uint32_t)buffer;
    dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
    dma_init_struct.direction = DMA_PERIPHERAL_TO_MEMORY;
    dma_init_struct.number = size;
    dma_init_struct.priority = DMA_PRIORITY_HIGH;
    dma_init(uart->dma.rx.channel, &dma_init_struct);

    /* enable transmit complete interrupt */
    nvic_irq_enable(uart->dma.rx.irq, 2);
    dma_interrupt_enable(uart->dma.rx.channel, DMA_CHXCTL_HTFIE);
    dma_interrupt_enable(uart->dma.rx.channel, DMA_CHXCTL_FTFIE);

    /* enable dma channel */
    dma_channel_enable(uart->dma.rx.channel);

    /* enable usart idle interrupt */
    usart_interrupt_enable(uart->periph, USART_INT_IDLE);

    /* enable dma receive */
    usart_dma_receive_config(uart->periph, USART_DENR_ENABLE);
    #else
    dma_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_FLAG_FEE);
    dma_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_FLAG_SDE);
    dma_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_FLAG_TAE);
    dma_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_FLAG_HTF);
    dma_flag_clear(uart->dma.rx.periph, uart->dma.rx.channel, DMA_FLAG_FTF);
    dma_channel_disable(uart->dma.rx.periph, uart->dma.rx.channel);
    dma_deinit(uart->dma.rx.periph, uart->dma.rx.channel);

    /* configure receive DMA */
    rcu_periph_clock_enable(uart->dma.rx.rcu);
    dma_deinit(uart->dma.rx.periph, uart->dma.rx.channel);

    dma_single_data_parameter_struct dma_init_struct = { 0 };

    dma_init_struct.number              = size;
    dma_init_struct.memory0_addr        = (uint32_t)buffer;
    dma_init_struct.periph_addr         = (uint32_t)&USART_DATA(uart->periph);
    dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
    dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
    dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_ENABLE;
    dma_init_struct.direction           = DMA_PERIPH_TO_MEMORY;
    dma_init_struct.priority            = DMA_PRIORITY_HIGH;
    dma_single_data_mode_init(uart->dma.rx.periph, uart->dma.rx.channel, &dma_init_struct);
    dma_channel_subperipheral_select(uart->dma.rx.periph, uart->dma.rx.channel, uart->dma.rx.subperiph);

    /* enable transmit complete interrupt */
    nvic_irq_enable(uart->dma.rx.irq, 2, 0);
    dma_interrupt_enable(uart->dma.rx.periph, uart->dma.rx.channel, DMA_CHXCTL_HTFIE);
    dma_interrupt_enable(uart->dma.rx.periph, uart->dma.rx.channel, DMA_CHXCTL_FTFIE);

    /* enable dma channel */
    dma_channel_enable(uart->dma.rx.periph, uart->dma.rx.channel);

