RT-Thread/rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_usart_v2.c
    /* enable usart idle interrupt */
    usart_interrupt_enable(uart->periph, USART_INT_IDLE);

    /* enable dma receive */
    usart_dma_receive_config(uart->periph, USART_RECEIVE_DMA_ENABLE);
    #endif
}

static void _uart_dma_transmit (struct gd32_uart *uart, rt_uint8_t *buffer, rt_uint32_t size)
{
    #if defined SOC_SERIES_GD32E23x
    DMA_CHMADDR(uart->dma.tx.channel) = (uint32_t)buffer;
    DMA_CHCNT(uart->dma.tx.channel) = size;

    usart_dma_transmit_config(uart->periph, USART_DENT_ENABLE);

    dma_channel_enable(uart->dma.tx.channel);
    #else
    /* Set the data length and data pointer */
    DMA_CHM0ADDR(uart->dma.tx.periph, uart->dma.tx.channel) = (uint32_t)buffer;
    DMA_CHCNT(uart->dma.tx.periph, uart->dma.tx.channel) = size;

    /* enable dma transmit */
    usart_dma_transmit_config(uart->periph, USART_TRANSMIT_DMA_ENABLE);

    /* enable dma channel */
    dma_channel_enable(uart->dma.tx.periph, uart->dma.tx.channel);
    #endif
}

static void gd32_dma_config (struct rt_serial_device *serial, rt_ubase_t flag)
{
    struct gd32_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    RT_ASSERT(flag == RT_DEVICE_FLAG_DMA_TX || flag == RT_DEVICE_FLAG_DMA_RX);

    /* enable rx dma */
    if (flag == RT_DEVICE_FLAG_DMA_TX)
    {
        #if defined SOC_SERIES_GD32E23x
        dma_flag_clear(uart->dma.tx.channel, DMA_FLAG_G);
        dma_flag_clear(uart->dma.tx.channel, DMA_FLAG_FTF);
        dma_flag_clear(uart->dma.tx.channel, DMA_FLAG_HTF);
        dma_flag_clear(uart->dma.tx.channel, DMA_FLAG_ERR);
        dma_channel_disable(uart->dma.tx.channel);
        dma_deinit(uart->dma.tx.channel);
        /* configure receive DMA */
        rcu_periph_clock_enable(uart->dma.tx.rcu);
        dma_deinit( uart->dma.tx.channel);


        dma_parameter_struct dma_init_struct = { 0 };
        dma_init_struct.periph_addr = (uint32_t)&USART_TDATA(uart->periph);
        dma_init_struct.periph_inc = DMA_PERIPH_INCREASE_DISABLE;
        dma_init_struct.memory_inc = DMA_MEMORY_INCREASE_ENABLE;
        dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_8BIT;
        dma_init_struct.memory_width = DMA_MEMORY_WIDTH_8BIT;
        dma_init_struct.direction = DMA_MEMORY_TO_PERIPHERAL;
        dma_init_struct.priority = DMA_PRIORITY_HIGH;

        dma_init(uart->dma.tx.channel, &dma_init_struct);

        /* enable tx dma interrupt */
        nvic_irq_enable(uart->dma.tx.irq, 2);

        /* enable transmit complete interrupt */
        dma_interrupt_enable(uart->dma.tx.channel, DMA_INT_FTF);
        #else
        /* clear all the interrupt flags */
        dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_FEE);
        dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_SDE);
        dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_TAE);
        dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_HTF);
        dma_flag_clear(uart->dma.tx.periph, uart->dma.tx.channel, DMA_FLAG_FTF);
        dma_channel_disable(uart->dma.tx.periph, uart->dma.tx.channel);
        dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);

        /* configure receive DMA */
        rcu_periph_clock_enable(uart->dma.tx.rcu);
        dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);

        dma_single_data_parameter_struct dma_init_struct = { 0 };

        dma_init_struct.periph_addr         = (uint32_t)&USART_DATA(uart->periph);
        dma_init_struct.periph_memory_width = DMA_PERIPH_WIDTH_8BIT;
        dma_init_struct.periph_inc          = DMA_PERIPH_INCREASE_DISABLE;
        dma_init_struct.memory_inc          = DMA_MEMORY_INCREASE_ENABLE;
        dma_init_struct.circular_mode       = DMA_CIRCULAR_MODE_DISABLE;
        dma_init_struct.direction           = DMA_MEMORY_TO_PERIPH;
        dma_init_struct.priority            = DMA_PRIORITY_HIGH;
        dma_single_data_mode_init(uart->dma.tx.periph, uart->dma.tx.channel, &dma_init_struct);
        dma_channel_subperipheral_select(uart->dma.tx.periph, uart->dma.tx.channel, uart->dma.tx.subperiph);

        /* enable tx dma interrupt */
        nvic_irq_enable(uart->dma.tx.irq, 2, 0);

        /* enable transmit complete interrupt */
        dma_interrupt_enable(uart->dma.tx.periph, uart->dma.tx.channel, DMA_CHXCTL_FTFIE);
        #endif
    }

    /* enable rx dma */
    if (flag == RT_DEVICE_FLAG_DMA_RX)
    {
        rt_uint8_t *ptr = NULL;
        rt_hw_serial_control_isr(serial, RT_HW_SERIAL_CTRL_GET_DMA_PING_BUF, &ptr);

        /* start dma transfer */
        _uart_dma_receive(uart, ptr, serial->config.dma_ping_bufsz);
    }
}

#endif

/**
  * @brief  uart control
  * @param  serial, arg
  * @retval None
  */
static rt_err_t gd32_uart_control (struct rt_serial_device *serial, int cmd, void *arg)
{
    struct gd32_uart *uart;

    rt_ubase_t ctrl_arg = (rt_ubase_t)arg;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct gd32_uart, serial);

    if (ctrl_arg & (RT_DEVICE_FLAG_RX_BLOCKING | RT_DEVICE_FLAG_RX_NON_BLOCKING))
    {
        if (uart->uart_dma_flag & RT_DEVICE_FLAG_DMA_RX)
            ctrl_arg = RT_DEVICE_FLAG_DMA_RX;
        else
            ctrl_arg = RT_DEVICE_FLAG_INT_RX;
    }
    else if (ctrl_arg & (RT_DEVICE_FLAG_TX_BLOCKING | RT_DEVICE_FLAG_TX_NON_BLOCKING))
    {
        if (uart->uart_dma_flag & RT_DEVICE_FLAG_DMA_TX)
            ctrl_arg = RT_DEVICE_FLAG_DMA_TX;
        else
            ctrl_arg = RT_DEVICE_FLAG_INT_TX;
    }

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        /* disable rx irq */
        NVIC_DisableIRQ(uart->irqn);

        /* disable interrupt */
        if (ctrl_arg == RT_DEVICE_FLAG_INT_RX)
        {
            usart_interrupt_disable(uart->periph, USART_INT_RBNE);
        }
        else if (ctrl_arg == RT_DEVICE_FLAG_INT_TX)
        {
            usart_interrupt_disable(uart->periph, USART_INT_TBE);
        }

#ifdef RT_SERIAL_USING_DMA
        /* disable DMA */
        else if (ctrl_arg == RT_DEVICE_FLAG_DMA_RX)
        {
            usart_interrupt_disable(uart->periph, USART_INT_RBNE);
            NVIC_DisableIRQ(uart->dma.rx.irq);
            #if defined SOC_SERIES_GD32E23x
            dma_deinit(uart->dma.rx.channel);
            #else
            dma_deinit(uart->dma.rx.periph, uart->dma.rx.channel);
            #endif
        }
        else if(ctrl_arg == RT_DEVICE_FLAG_DMA_TX)
        {
            usart_interrupt_disable(uart->periph, USART_INT_TBE);
            NVIC_DisableIRQ(uart->dma.tx.irq);
            #if defined SOC_SERIES_GD32E23x
            dma_deinit(uart->dma.tx.channel);
            #else
            dma_deinit(uart->dma.tx.periph, uart->dma.tx.channel);
            #endif
        }
#endif
        break;

    case RT_DEVICE_CTRL_SET_INT:
        /* enable rx irq */
        NVIC_EnableIRQ(uart->irqn);

        /* enable interrupt */
        if (ctrl_arg == RT_DEVICE_FLAG_INT_RX)
        {
            usart_interrupt_enable(uart->periph, USART_INT_RBNE);
        }
        else if (ctrl_arg == RT_DEVICE_FLAG_INT_TX)
        {
            usart_interrupt_enable(uart->periph, USART_INT_TBE);
        }
        break;

    case RT_DEVICE_CTRL_CONFIG:
        if(ctrl_arg & (RT_DEVICE_FLAG_DMA_RX | RT_DEVICE_FLAG_DMA_TX))
        {
#ifdef RT_SERIAL_USING_DMA
        gd32_dma_config(serial, ctrl_arg);
#endif
        }
        else
        {
            gd32_uart_control(serial, RT_DEVICE_CTRL_SET_INT, (void *)ctrl_arg);
        }
        break;

    case RT_DEVICE_CHECK_OPTMODE:
        if(ctrl_arg & RT_DEVICE_FLAG_DMA_TX)
            return RT_SERIAL_TX_BLOCKING_NO_BUFFER;
        else
            return RT_SERIAL_TX_BLOCKING_BUFFER;

    case RT_DEVICE_CTRL_CLOSE:
        usart_deinit(uart->periph);
        break;
    }

